Assignment Instructions:

1.Install [Anaconda](https://www.anaconda.com/products/individual):

    Take Python 3.x version (not 2.x)
    
    Select “Add Anaconda to System PATH” during installation


2.Jupyter notebook is part of the Anaconda package.

    Open the console (on Windows: open Anaconda Prompt) and run command

    jupyter notebook
 

3.Open "Assignment_1.ipynb" in Jupyter Notebook.



When we want to work with SQL easily in an Ipython notebook, we'll load the ipython-sql extension.

To install ipython-sql with Anaconda, using the [command](https://anaconda.org/conda-forge/ipython-sql):

    conda install -c conda-forge ipython-sql

**Note: DO NOT PANIC** 
* Don't worry if you get (a) a big red-highlighted warning or (b) a note that the extension has already been loaded!  As long as your SQL commands work, it's loaded properly!

In [1]:
%load_ext sql

Next, load an SQLite database stored as a file as follows:

**NOTE: We load a file below (here, "Movie-Rating.db", which must be in the same directory as the notebook. You'll use this file throughout the first assignment. Make sure to download the from the BlackBoard exercise webpage!!**

In [2]:
%sql sqlite:///Movie-Rating.db

'Connected: @Movie-Rating.db'

**`%sql` is used for single line SQL commands:**

In [3]:
%sql SELECT * FROM Movie LIMIT 1;

 * sqlite:///Movie-Rating.db
Done.

[(101, 'Gone with the Wind', 1939, 'Victor Fleming')]

And **`%%sql` is used for multi-line SQL commands:**

In [4]:
%%sql
SELECT SUM(r.stars) 
FROM Rating r, Movie m
WHERE m.mID = r.mID AND m.year = 1939;

 * sqlite:///Movie-Rating.db
Done.

[(9,)]

**Assignment Descriptions**

You've started a new movie-rating website, and you've been collecting data on reviewers' ratings of various movies. There's
not much data yet, but you can still try out some interesting queries. Here's the schema:

Movie ( mID, title, year, director )
Explanation: There is a movie with ID number mID, a title, a release year, and a director.

Reviewer ( rID, name )
Explanation: The reviewer with ID number rID has a certain name.

Rating ( rID, mID, stars, ratingDate )
Explanation: The reviewer rID gave the movie mID a number of stars rating (1-5) on a certain ratingDate.

Your queries will run over a small data set conforming to the schema. You can see the data overview in the file 8- data overview.pdf.

**Instructions**

Each problem asks you to write a query in SQL. You can run your code by clicking Run button on the top of the page.

**Important Notes**

1- Your queries are executed using SQLite, so you must conform to the SQL constructs supported by SQLite.

2- Unless a specific result ordering is asked for, you can return the result rows in any order.

3- You are to translate the English into a SQL query that computes the desired result over all possible databases. I will give you the correct output two weeks later as a reference. However, just to check the answer is not enough. This means for our small sample database, even if your answer is correct, it is possible that your query does not correctly reflect the problem at hand. (For example, if we ask for a complex condition that requires accessing all of the tables, but over our small data set in the end the condition is satisfied only by Star Wars, then the query "select title from Movie where title = 'Star Wars'" will get correct answer even though it doesn't reflect the actual question.) Circumventing the system in this fashion is not a good idea to help you learn SQL. On the other hand, an incorrect attempt at a general solution is unlikely to produce the right answer, so you shouldn't be led astray by just checking the answer.

**Assignment Questions**

This assignment includes three exercises **[Movie-Rating Query Exercises], [Movie-Rating Query Exercises Extras]** and **[Movie-Rating Modification Exercises]**. All questions for Movie-Rating Query Excercises are mandatory for Exercise Assignment-1. Fill your answers in this template. The answer to the first question of the first exercise is given as an example.

**What to hand in:**

1. Generate a HTML report from this notebook template with answers (File > Download as > HTML).
2. This "Assignment_1.ipynb" file with answers.

Movie-Rating Query Exercises, Q1:
Find the titles of all movies directed by Steven Spielberg.

In [5]:
%%sql
SELECT title
FROM movie
WHERE director = 'Steven Spielberg';

 * sqlite:///Movie-Rating.db
Done.

[('E.T.',), ('Raiders of the Lost Ark',)]

Movie-Rating Query Exercises, Q2:

Find all years that have a movie that received a rating of 4 or 5, and sort them in increasing order.

In [6]:
%%sql
SELECT year
FROM Rating, Movie
WHERE Rating.mID = Movie.mID
    AND (Rating.stars = 4 OR Rating.stars = 5)
GROUP BY year
ORDER BY year ASC;

 * sqlite:///Movie-Rating.db
Done.

[(1937,), (1939,), (1981,), (2009,)]

Movie-Rating Query Exercises, Q3:

Find the titles of all movies that have no ratings.

In [7]:
%%sql
SELECT Movie.title
FROM Movie
LEFT JOIN Rating
ON Movie.mID = Rating.mID
WHERE Rating.rID IS NULL;

 * sqlite:///Movie-Rating.db
Done.

[('Star Wars',), ('Titanic',)]

Movie-Rating Query Exercises, Q4:

Some reviewers didn't provide a date with their rating. Find the names of all reviewers who have ratings with a NULL value
for the date.

In [8]:
%%sql
SELECT Reviewer.name
FROM Reviewer, Rating
WHERE Reviewer.rID = Rating.rID
    AND Rating.ratingDate IS NULL;

 * sqlite:///Movie-Rating.db
Done.

[('Daniel Lewis',), ('Chris Jackson',)]

Movie-Rating Query Exercises, Q5:

Write a query to return the ratings data in a more readable format: reviewer name, movie title, stars, and ratingDate. Also,
sort the data, first by reviewer name, then by movie title, and lastly by number of stars.

In [9]:
%%sql
SELECT Reviewer.name as reviewerName, Movie.title, Rating.stars, Rating.ratingDate
FROM Reviewer, Movie, Rating
WHERE Movie.mID = Rating.mID
    AND Rating.rID = Reviewer.rID
ORDER BY name, title, stars ASC;

 * sqlite:///Movie-Rating.db
Done.

[('Ashley White', 'E.T.', 3, '2011-01-02'),
 ('Brittany Harris', 'Raiders of the Lost Ark', 2, '2011-01-30'),
 ('Brittany Harris', 'Raiders of the Lost Ark', 4, '2011-01-12'),
 ('Brittany Harris', 'The Sound of Music', 2, '2011-01-20'),
 ('Chris Jackson', 'E.T.', 2, '2011-01-22'),
 ('Chris Jackson', 'Raiders of the Lost Ark', 4, None),
 ('Chris Jackson', 'The Sound of Music', 3, '2011-01-27'),
 ('Daniel Lewis', 'Snow White', 4, None),
 ('Elizabeth Thomas', 'Avatar', 3, '2011-01-15'),
 ('Elizabeth Thomas', 'Snow White', 5, '2011-01-19'),
 ('James Cameron', 'Avatar', 5, '2011-01-20'),
 ('Mike Anderson', 'Gone with the Wind', 3, '2011-01-09'),
 ('Sarah Martinez', 'Gone with the Wind', 2, '2011-01-22'),
 ('Sarah Martinez', 'Gone with the Wind', 4, '2011-01-27')]

Movie-Rating Query Exercises, Q6:

For all cases where the same reviewer rated the same movie twice and gave it a higher rating the second time, return the
reviewer's name and the title of the movie.

In [10]:
%%sql
WITH
RatingCopy1 AS (
SELECT *
FROM Rating
),
RatingCopy2 AS (
SELECT *
FROM Rating
)

SELECT Reviewer.name, Movie.title
FROM Reviewer, Movie, RatingCopy1, RatingCopy2
WHERE Movie.mID = RatingCopy1.mID 
    AND Movie.mID = RatingCopy2.mID
    AND Reviewer.rID = RatingCopy1.rID
    AND Reviewer.rID = RatingCopy2.rID
    AND RatingCopy1.stars < RatingCopy2.stars
    AND RatingCopy1.ratingDate < RatingCopy2.ratingDate;

 * sqlite:///Movie-Rating.db
Done.

[('Sarah Martinez', 'Gone with the Wind')]

Movie-Rating Query Exercises, Q7:

For each movie that has at least one rating, find the highest number of stars that movie received. Return the movie title and
number of stars. Sort by movie title.

In [11]:
%%sql
SELECT Movie.title, Rating.stars
FROM Movie, Rating
WHERE Movie.mID = Rating.mID
GROUP BY title
HAVING max(stars)
ORDER BY title ASC;

 * sqlite:///Movie-Rating.db
Done.

[('Avatar', 5),
 ('E.T.', 3),
 ('Gone with the Wind', 4),
 ('Raiders of the Lost Ark', 4),
 ('Snow White', 5),
 ('The Sound of Music', 3)]

Movie-Rating Query Exercises, Q8:

For each movie, return the title and the 'rating spread', that is, the difference between highest and lowest ratings given to that movie. Sort by rating spread from highest to lowest, then by movie title.

In [12]:
%%sql
SELECT Movie.title, max(Rating.stars) - min(Rating.stars) as delta
FROM Movie, Rating
WHERE Movie.mID = Rating.mID
GROUP BY title
ORDER BY delta DESC, title ASC;

 * sqlite:///Movie-Rating.db
Done.

[('Avatar', 2),
 ('Gone with the Wind', 2),
 ('Raiders of the Lost Ark', 2),
 ('E.T.', 1),
 ('Snow White', 1),
 ('The Sound of Music', 1)]

Movie-Rating Query Exercises, Q9:

Find the difference between the average rating of movies released before 1980 and the average rating of movies released
after 1980. (Make sure to calculate the average rating for each movie, then the average of those averages for movies before
1980 and movies after. Don't just calculate the overall average rating before and after 1980.)

In [13]:
%%sql
WITH before1980 AS (
SELECT Movie.mID, AVG(Rating.stars) AS avgStars
FROM Movie, Rating
WHERE Movie.mID = Rating.mID
AND Movie.year < 1980
GROUP BY Movie.mID
),
after1980 AS (
SELECT Movie.mID, AVG(Rating.stars) AS avgStars
FROM Movie, Rating
WHERE Movie.mID = Rating.mID
AND Movie.year > 1980
GROUP BY Movie.mID
)

SELECT AVG(before1980.avgStars) - AVG(after1980.avgStars) AS delta
FROM after1980, before1980;

 * sqlite:///Movie-Rating.db
Done.

[(0.055555555555556246,)]

Movie-Rating Query Exercises Extras, Q1:

Find the names of all reviewers who rated Gone with the Wind.

In [14]:
%%sql
WITH
movieID AS(
    SELECT Movie.mID
    FROM Movie
    WHERE Movie.title = "Gone with the Wind"
),
reviewers AS(
    SELECT DISTINCT(Rating.rID) AS rID
    FROM Rating, movieID
    WHERE Rating.mID = movieID.mID
)

SELECT DISTINCT(Reviewer.name)
FROM Reviewer, Movie, reviewers
WHERE Reviewer.rID IN (reviewers.rID)

 * sqlite:///Movie-Rating.db
Done.

[('Sarah Martinez',), ('Mike Anderson',)]

Movie-Rating Query Exercises Extras, Q2:

For any rating where the reviewer is the same as the director of the movie, return the reviewer name, movie title, and
number of stars.

In [15]:
%%sql
SELECT Reviewer.name, Movie.title, Rating.stars
FROM Movie, Reviewer, Rating
WHERE Movie.director = Reviewer.name
        AND Reviewer.rID = Rating.rID
        AND Rating.mID = Movie.mID;

 * sqlite:///Movie-Rating.db
Done.

[('James Cameron', 'Avatar', 5)]

Movie-Rating Query Exercises Extras, Q3:

Return all reviewer names and movie names together in a single list, alphabetized. (Sorting by the first name of the reviewer
and first word in the title is fine; no need for special processing on last names or removing "The".)

In [16]:
%%sql
SELECT Reviewer.name
FROM Reviewer
UNION
SELECT Movie.title
FROM Movie
ORDER BY name, title;

 * sqlite:///Movie-Rating.db
Done.

[('Ashley White',),
 ('Avatar',),
 ('Brittany Harris',),
 ('Chris Jackson',),
 ('Daniel Lewis',),
 ('E.T.',),
 ('Elizabeth Thomas',),
 ('Gone with the Wind',),
 ('James Cameron',),
 ('Mike Anderson',),
 ('Raiders of the Lost Ark',),
 ('Sarah Martinez',),
 ('Snow White',),
 ('Star Wars',),
 ('The Sound of Music',),
 ('Titanic',)]

Movie-Rating Query Exercises Extras, Q4:

Find the titles of all movies not reviewed by Chris Jackson.

In [17]:
%%sql
SELECT DISTINCT Movie.title
FROM Movie
WHERE Movie.mID NOT IN (
    SELECT Movie.mID
    FROM Movie, Rating
    WHERE Movie.mID = Rating.mID
        AND Rating.rID IN (
            SELECT Reviewer.rID
            FROM Reviewer
            WHERE Reviewer.name = 'Chris Jackson'
        )
    )
ORDER BY title;

 * sqlite:///Movie-Rating.db
Done.

[('Avatar',),
 ('Gone with the Wind',),
 ('Snow White',),
 ('Star Wars',),
 ('Titanic',)]

Movie-Rating Query Exercises Extras, Q5:

For all pairs of reviewers such that both reviewers gave a rating to the same movie, return the names of both reviewers.
Eliminate duplicates, don't pair reviewers with themselves, and include each pair only once. For each pair, return the names
in the pair in alphabetical order.

In [18]:
%%sql
WITH
RatingCopy1 AS (
SELECT *
FROM Rating
),
RatingCopy2 AS (
SELECT *
FROM Rating
),
ReviewerCopy1 AS (
SELECT *
FROM Reviewer
),
ReviewerCopy2 AS (
SELECT *
FROM Reviewer
)

SELECT DISTINCT ReviewerCopy1.name AS name1, ReviewerCopy2.name AS name2
FROM ReviewerCopy1, ReviewerCopy2, RatingCopy1, RatingCopy2
WHERE RatingCopy1.mID = RatingCopy2.mID
    AND ReviewerCopy1.rID != ReviewerCopy2.rID
    AND ReviewerCopy1.rID = RatingCopy1.rID
    AND ReviewerCopy2.rID = RatingCopy2.rID

    -- Removes duplicates 
    AND ReviewerCopy1.name < ReviewerCopy2.name
ORDER BY name1, name2;

 * sqlite:///Movie-Rating.db
Done.

[('Ashley White', 'Chris Jackson'),
 ('Brittany Harris', 'Chris Jackson'),
 ('Daniel Lewis', 'Elizabeth Thomas'),
 ('Elizabeth Thomas', 'James Cameron'),
 ('Mike Anderson', 'Sarah Martinez')]

Movie-Rating Query Exercises Extras, Q6:

For each rating that is the lowest (fewest stars) currently in the database, return the reviewer name, movie title, and number
of stars.

In [19]:
%%sql
WITH 
lowestStars AS (
SELECT MIN(Rating.stars)
FROM Rating
)

SELECT Reviewer.name, Movie.title, Rating.stars
FROM Reviewer, Movie, Rating
WHERE Movie.mID = Rating.mID
    AND Rating.rID = Reviewer.rID
    AND Rating.stars IN lowestStars;

 * sqlite:///Movie-Rating.db
Done.

[('Sarah Martinez', 'Gone with the Wind', 2),
 ('Brittany Harris', 'The Sound of Music', 2),
 ('Brittany Harris', 'Raiders of the Lost Ark', 2),
 ('Chris Jackson', 'E.T.', 2)]

Movie-Rating Query Exercises Extras, Q7:

List movie titles and average ratings, from highest-rated to lowest-rated. If two or more movies have the same average rating,
list them in alphabetical order.

In [20]:
%%sql
WITH 
avgRating AS (
SELECT Rating.mID, AVG(Rating.stars) AS avgStars
FROM Rating
GROUP BY Rating.mID
)

SELECT Movie.title, avgRating.avgStars
FROM Movie, avgRating
WHERE Movie.mID = avgRating.mID
ORDER BY avgStars DESC, title;

 * sqlite:///Movie-Rating.db
Done.

[('Snow White', 4.5),
 ('Avatar', 4.0),
 ('Raiders of the Lost Ark', 3.3333333333333335),
 ('Gone with the Wind', 3.0),
 ('E.T.', 2.5),
 ('The Sound of Music', 2.5)]

Movie-Rating Query Exercises Extras, Q8:

Find the names of all reviewers who have contributed three or more ratings. (As an extra challenge, try writing the query
without HAVING or without COUNT.)

In [21]:
%%sql
WITH reviewerMap AS (
SELECT Rating.rID, COUNT(Rating.rID) AS counter
FROM Rating
GROUP BY Rating.rID
)

SELECT Reviewer.name
FROM reviewerMap
JOIN Reviewer ON Reviewer.rID = reviewerMap.rID
WHERE ReviewerMap.counter >= 3;

 * sqlite:///Movie-Rating.db
Done.

[('Brittany Harris',), ('Chris Jackson',)]

Movie-Rating Query Exercises Extras, Q9:

Some directors directed more than one movie. For all such directors, return the titles of all movies directed by them, along
with the director name. Sort by director name, then movie title. (As an extra challenge, try writing the query both with and
without COUNT.)

In [22]:
%%sql
WITH directorMap AS (
SELECT Movie.mID, Movie.director, COUNT(Movie.director) AS counter
FROM Movie
WHERE Movie.director IS NOT NULL
GROUP BY Movie.director
)

SELECT Movie.title, Movie.director
FROM Movie
WHERE Movie.director IN (
    SELECT directorMap.director
    FROM directorMap
    WHERE counter >= 2
    )
ORDER BY director, title;

 * sqlite:///Movie-Rating.db
Done.

[('Avatar', 'James Cameron'),
 ('Titanic', 'James Cameron'),
 ('E.T.', 'Steven Spielberg'),
 ('Raiders of the Lost Ark', 'Steven Spielberg')]

Movie-Rating Query Exercises Extras, Q10:

Find the movie(s) with the highest average rating. Return the movie title(s) and average rating. (Hint: This query is more
difficult to write in SQLite than other systems; you might think of it as finding the highest average rating and then choosing
the movie(s) with that average rating.)

In [23]:
%%sql
WITH 
avgRating AS (
SELECT Rating.mID, AVG(Rating.stars) AS avgStars
FROM Rating
GROUP BY Rating.mID
)

SELECT Movie.title, avgRating.avgStars AS highestRating
FROM Movie, avgRating
WHERE Movie.mID = avgRating.mID
    AND avgRating.avgStars = (
        SELECT MAX(avgRating.avgStars)
        FROM avgRating
    )
;

 * sqlite:///Movie-Rating.db
Done.

[('Snow White', 4.5)]

Movie-Rating Query Exercises Extras, Q11:

Find the movie(s) with the lowest average rating. Return the movie title(s) and average rating. (Hint: This query may be more
difficult to write in SQLite than other systems; you might think of it as finding the lowest average rating and then choosing
the movie(s) with that average rating.)

In [24]:
%%sql
WITH 
avgRating AS (
SELECT Rating.mID, AVG(Rating.stars) AS avgStars
FROM Rating
GROUP BY Rating.mID
)

SELECT Movie.title, avgRating.avgStars AS lowestRating
FROM Movie, avgRating
WHERE Movie.mID = avgRating.mID
    AND avgRating.avgStars = (
        SELECT MIN(avgRating.avgStars)
        FROM avgRating
    )
;

 * sqlite:///Movie-Rating.db
Done.

[('The Sound of Music', 2.5), ('E.T.', 2.5)]

Movie-Rating Query Exercises Extras, Q12:

For each director, return the director's name together with the title(s) of the movie(s) they directed that received the highest
rating among all of their movies, and the value of that rating. Ignore movies whose director is NULL.

In [25]:
%%sql
WITH 
highestRating AS (
SELECT Rating.mID, MAX(Rating.stars) AS maxStars
FROM Rating
GROUP BY Rating.mID
)

SELECT Movie.director, Movie.title, MAX(highestRating.maxStars) AS stars
FROM Movie, highestRating
WHERE Movie.mID = highestRating.mID
AND Movie.director IS NOT NULL
GROUP BY director;

 * sqlite:///Movie-Rating.db
Done.

[('James Cameron', 'Avatar', 5),
 ('Robert Wise', 'The Sound of Music', 3),
 ('Steven Spielberg', 'Raiders of the Lost Ark', 4),
 ('Victor Fleming', 'Gone with the Wind', 4)]

**To check your data modification statement, we ran the following query after your modification: select * from Movie order by
mID**

Movie-Rating Modification Exercises, Q1:

Add the reviewer Roger Ebert to your database, with an rID of 209.

In [26]:
%%sql
INSERT
INTO Reviewer(rID, name)
VALUES(209, 'Roger Ebert');

 * sqlite:///Movie-Rating.db
1 rows affected.

[]

Movie-Rating Modification Exercises, Q2:

Insert 5-star ratings by James Cameron for all movies in the database. Leave the review date as NULL.

In [27]:
%%sql
WITH
cameronID AS (
SELECT Reviewer.rID AS rID
FROM Reviewer
WHERE Reviewer.name = 'James Cameron'
GROUP BY Reviewer.rID
)

INSERT
INTO Rating(rID, mID, stars, ratingDate)
SELECT cameronID.rID, Movie.mID, 5, NULL
FROM Movie, cameronID;

 * sqlite:///Movie-Rating.db
Done.

[]

Movie-Rating Modification Exercises, Q3:

For all movies that have an average rating of 4 stars or higher, add 25 to the release year. (Update the existing tuples; don't
insert new tuples.)

In [28]:
%%sql
WITH
avgRatingMap AS (
SELECT Movie.mID, AVG(Rating.stars) AS avg
FROM Movie, Rating
WHERE Movie.mID = Rating.mID
GROUP BY Movie.mID
)

UPDATE Movie
SET year = year + 25
WHERE Movie.mID IN (
SELECT Movie.mID
FROM Movie, avgRatingMap
WHERE Movie.mID = avgRatingMap.mID
    AND avgRatingMap.avg >= 4
);

 * sqlite:///Movie-Rating.db
Done.

[]

Movie-Rating Modification Exercises, Q4:

Remove all ratings where the movie's year is before 1970 or after 2000, and the rating is fewer than 4 stars.

In [29]:
%%sql
DELETE
FROM Rating
WHERE Rating.mID IN (
SELECT Movie.mID
FROM Movie, Rating
WHERE Movie.mID = Rating.mID
    AND Movie.year < 1970 OR Movie.year > 2000
    AND Rating.stars < 4
);

 * sqlite:///Movie-Rating.db
15 rows affected.

[]